<?php
/******************************************************************************/
/*                                                                            */
/*                       __        ____                                       */
/*                 ___  / /  ___  / __/__  __ _____________ ___               */
/*                / _ \/ _ \/ _ \_\ \/ _ \/ // / __/ __/ -_|_-<               */
/*               / .__/_//_/ .__/___/\___/\_,_/_/  \__/\__/___/               */
/*              /_/       /_/                                                 */
/*                                                                            */
/*                                                                            */
/******************************************************************************/
/*                                                                            */
/* Titre          : Passer une chaine utf8 en Latin                           */
/*                                                                            */
/* URL            : http://www.phpsources.org/scripts442-PHP.htm              */
/* Auteur         : PhpSources                                                */
/* Date édition   : 13 Aout 2008                                              */
/* Website auteur : http://www.phpsources.org                                 */
/*                                                                            */
/******************************************************************************/


 function utf8_vers_latin($machaine)
{   

    $tab_utf8 = Array("/Ã§/","/ä§/","/Ã©/","/ä©/","/Ã¨/","/ä¨/","/Ãª/","/äª/",
                      "/Ã«/","/ä«/","/ÃŠ/","/äŠ/","/Ã‹/","/ä‹/","/Ã®/","/ä®/",
                      "/Ã¯/","/ä¯/","/Ã¬/","/ÃŽ/","/äŽ/","/Ã²/","/ä²/","/Ã´/",
                      "/ä´/","/Ã¶/","/ä¶/","/Ãµ/","/Ã³/","/Ã¸/","/äµ/","/ä³/",
                      "/ä¸/","/Ã”/","/ä”/","/Ã–/","/ä–/","/Ã/","/ä/","/Ã¢/",
                      "/ä¢/","/Ã¤/","/ä¤/","/Ã¥/","/ä¥/","/Ã‚/","/ä‚/","/Ã„/",
                      "/ä„/","/Ã¹/","/Ã»/","/Ã¼/","/ä¼/","/Ã›/","/Ãœ/","/ä¹/",
                      "/ä»/","/ä¼/","/ä¼/","/ä›/","/äœ/","/Ã²/","/Ã±/","/â€™/","/�/");

    $tab_latin = Array("ç", "ç", "é", "é", "è", "è", "ê", "ê", "ë", "ë", "Ê", "Ê",
                       "Ë", "Ë", "î", "î", "ï", "ï", "ì", "Î", "Î", "ò", "ò", "ô",
                       "ô", "ö", "ö", "õ", "ó", "ø", "õ", "ó", "ø", "Ô", "Ô", "Ö",
                       "Ö", "à", "à", "â", "â", "ä", "ä", "å", "å", "Â", "Â", "Ä",
                       "Ä", "u", "û", "ü", "ü", "Û", "Ü", "u", "û", "ü", "ü", "Û",
                       "Ü", "ñ", "ñ", "'", "°");
   
    $machaine = preg_replace($tab_utf8, $tab_latin, $machaine);
     
    return $machaine;
} 


 $texte = 'la tÃ©lÃ© câ€™est kool mais Internet câ€™est mieux!';
 echo utf8_vers_latin($texte);

 // affiche
 // la télé c'est kool mais Internet c'est mieux! 
�
 ?>
